src/Documents/инкПриказНаВыплатуКомпенсации/инкПриказНаВыплатуКомпенсации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>инкПриказНаВыплатуКомпенсации</name>
  <attributes>
    <name>ВидОтпуска</name>
    <type>
      <types>EnumRef.инкВидыОтпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.инкДолжности</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.инкОснованияДляКадровыхПриказов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/инкПриказНаВыплатуКомпенсации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПриказНаВыплатуКомпенсации(ДокументОбъект) Экспорт
	
	ПриказНаВыплатуКомпенсацииТабличныйДокумент = ПолучитьПриказНаВыплатуКомпенсацииТабличныйДокумент(ДокументОбъект);
	
	Возврат ПриказНаВыплатуКомпенсацииТабличныйДокумент;
	
КонецФункции                      

Функция ПолучитьПриказНаВыплатуКомпенсацииТабличныйДокумент(ДокументОбъект)
	
	МакетВедомости = ПолучитьМакет("ПриказНаВыплатуКомпенсации"); 
	ПриказНаВыплатуКомпенсацииТабличныйДокумент = Новый ТабличныйДокумент;

	КадровыеДанныеРуководителя = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ДокументОбъект.Руководитель);
 	
	// Приказ:			   
	ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Приказ");
	
	ЗаполнитьЗначенияСвойств(ОбластьДокумента.Параметры,ДокументОбъект);

	ОбластьДокумента.Параметры.НомерДокумента = ДокументОбъект.Номер;
	ОбластьДокумента.Параметры.ДатаДокумента = ДокументОбъект.Дата;
	ОбластьДокумента.Параметры.ПериодС 	= Строка(Формат(ДокументОбъект.ПериодС,"ДФ=dd.MM.yyyy"));
	ОбластьДокумента.Параметры.ПериодПО = Строка(Формат(ДокументОбъект.ПериодПО,"ДФ=dd.MM.yyyy"));
	
	ОбластьДокумента.Параметры.Должность = НРег(СклонениеПредставленийОбъектов.ПросклонятьФИО(ДокументОбъект.Должность, 3));

	ФИОСтрока = СклонениеПредставленийОбъектов.ПросклонятьФИО(ДокументОбъект.Сотрудник.ФИО, 3);
	ОбластьДокумента.Параметры.ФИО = ФИОСтрока;

	Если ЗначениеЗаполнено(КадровыеДанныеРуководителя) Тогда
		ОбластьДокумента.Параметры.ДиректорДолжность = КадровыеДанныеРуководителя.Должность;
		ОбластьДокумента.Параметры.РуководительРасшифровка = ДокументОбъект.Руководитель.ФИОСокращенное;
	КонецЕсли;
	
	ПриказНаВыплатуКомпенсацииТабличныйДокумент.Вывести(ОбластьДокумента);
	
	ПриказНаВыплатуКомпенсацииТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ПриказНаВыплатуКомпенсацииТабличныйДокумент; 
	
КонецФункции                      

#КонецОбласти

#КонецЕсли
